04_CFD/pipeline/sweep_run/cases/d-10p0_M0p150_aoa+8p0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    back
    {
        type            empty;
        physicalType    patch;
        nFaces          38984;
        startFace       61001;
    }
    front
    {
        type            empty;
        physicalType    patch;
        nFaces          38984;
        startFace       99985;
    }
    farfield
    {
        type            patch;
        physicalType    patch;
        nFaces          60;
        startFace       138969;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       139029;
    }
    flap
    {
        type            wall;
        physicalType    patch;
        nFaces          152;
        startFace       139049;
    }
    mainfoil
    {
        type            wall;
        physicalType    patch;
        nFaces          361;
        startFace       139201;
    }
)

// ************************************************************************* //
